In [2]:
import pandas as pd

In [4]:
df = pd.read_csv('Income_Data.csv')

In [6]:
df

        Name  Age  Income($)
0        Rob   27      70000
1    Michael   29      90000
2      Mohan   29      61000
3     Ismail   28      60000
4       Kory   42     150000
5     Gautam   39     155000
6      David   41     160000
7     Andrea   38     162000
8       Brad   36     156000
9   Angelina   35     130000
10    Donald   37     137000
11       Tom   26      45000
12    Arnold   27      48000
13     Jared   28      51000
14     Stark   29      49500
15    Ranbir   32      53000
16    Dipika   40      65000
17  Priyanka   41      63000
18      Nick   43      64000
19      Alia   39      80000
20       Sid   41      82000
21     Abdul   39      58000

In [8]:
df.head()

      Name  Age  Income($)
0      Rob   27      70000
1  Michael   29      90000
2    Mohan   29      61000
3   Ismail   28      60000
4     Kory   42     150000

In [10]:
df.head(2)

      Name  Age  Income($)
0      Rob   27      70000
1  Michael   29      90000

In [12]:
df.tail()

        Name  Age  Income($)
17  Priyanka   41      63000
18      Nick   43      64000
19      Alia   39      80000
20       Sid   41      82000
21     Abdul   39      58000

In [14]:
df.shape

(22, 3)

In [16]:
df.describe()

             Age      Income($)
count  22.000000      22.000000
mean   34.818182   90431.818182
std     5.901060   43505.964412
min    26.000000   45000.000000
25%    29.000000   58500.000000
50%    36.500000   67500.000000
75%    39.750000  135250.000000
max    43.000000  162000.000000

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22 entries, 0 to 21
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       22 non-null     object
 1   Age        22 non-null     int64
 2   Income($)  22 non-null     int64
dtypes: int64(2), object(1)
memory usage: 656.0+ bytes

In [39]:
df.columns

Index(['Name', 'Age', 'Income($)'], dtype='object')

In [69]:
df[:10]

       Name  Age  Income($)
0       Rob   27      70000
1   Michael   29      90000
2     Mohan   29      61000
3    Ismail   28      60000
4      Kory   42     150000
5    Gautam   39     155000
6     David   41     160000
7    Andrea   38     162000
8      Brad   36     156000
9  Angelina   35     130000

In [67]:
df['Income($)']

0      70000
1      90000
2      61000
3      60000
4     150000
5     155000
6     160000
7     162000
8     156000
9     130000
10    137000
11     45000
12     48000
13     51000
14     49500
15     53000
16     65000
17     63000
18     64000
19     80000
20     82000
21     58000
Name: Income($), dtype: int64

In [70]:
df['Income($)'][0:10]

0     70000
1     90000
2     61000
3     60000
4    150000
5    155000
6    160000
7    162000
8    156000
9    130000
Name: Income($), dtype: int64

In [26]:
df['Income($)'].max()

162000

In [28]:
df['Income($)'].min()

45000

In [30]:
df['Income($)'].mean()

90431.81818181818

In [35]:
df[df['Income($)']==df['Income($)'].max()]

     Name  Age  Income($)
7  Andrea   38     162000

In [36]:
df['Name'][df['Income($)']==df['Income($)'].max()]

7    Andrea
Name: Name, dtype: object